app/Services/CategoryService.php

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `id` DESC
---
    public function getAllCategories()
    {

        $categories = $this->categoryModel->asObject()->orderBy('id', 'DESC')->findAll();